////======================================
////
////	アクション処理[action.cpp]
////	Author : Yuuto Shimadu
////
////======================================
//
////ヘッダーのインクルード
//#include "action.h"
//#include "normalattack.h"
//#include "smash.h"
//#include "arial.h"
//
////============================
////コンストラクタ
////============================
//CAction::CAction() :
//	m_bEndAction(false)
//{
//
//}
//
////============================
////デストラクタ
////============================
//CAction::~CAction()
//{
//
//}
//
////============================
////初期化
////============================
//HRESULT CAction::Init()
//{
//	return S_OK;
//}
//
////============================
////更新
////============================
//void CAction::Update()
//{
//	
//}